#ifndef _VSCHED_H
#define _VSCHED_H

#include "vTask.h"

/**********************************************************************************************************
** Function name        :   vTaskHighestReady
** Descriptions         :   获取当前最高优先级且可运行的任务
** parameters           :   无
** Returned value       :   优先级最高的且可运行的任务
***********************************************************************************************************/
vTask *vTaskHighestReady(void);

/**********************************************************************************************************
** Function name        :   vTaskSchedInit
** Descriptions         :   初始化调度器
** parameters           :   无
** Returned value       :   无
***********************************************************************************************************/
void vTaskSchedInit(void);

/**********************************************************************************************************
** Function name        :   vTaskSchedDisable
** Descriptions         :   禁止任务调度
** parameters           :   无
** Returned value       :   无
***********************************************************************************************************/
void vTaskSchedDisable(void);

/**********************************************************************************************************
** Function name        :   vTaskSchedEnable
** Descriptions         :   允许任务调度
** parameters           :   无
** Returned value       :   无
***********************************************************************************************************/
void vTaskSchedEnable(void);

/**********************************************************************************************************
** Function name        :   vTaskSchedRdy
** Descriptions         :   将任务设置为就绪状态
** parameters           :   task    等待设置为就绪状态的任务
** Returned value       :   无
***********************************************************************************************************/
void vTaskSchedRdy(vTask *task);

/************************************************************************************************************ Function name        :   tSchedulerUnRdyTask
** Descriptions         :   vTaskSchedUnRdy
** Descriptions         :   将任务移除就绪状态
** parameters           :   task    等待移除就绪状态的任务
** Returned value       :   无
***********************************************************************************************************/
void vTaskSchedUnRdy(vTask *task);

/**********************************************************************************************************
** Function name        :   vTaskSchedRemove
** Descriptions         :   将任务从就绪列表中移除
** parameters           :   task    等待移除的任务
** Returned value       :   
***********************************************************************************************************/
void vTaskSchedRemove(vTask *task);

/**********************************************************************************************************
** Function name        :   vTaskSched
** Descriptions         :   任务调度接口。VidaOS通过它来选择下一个具体的任务，然后切换至该任务运行。
** parameters           :   无
** Returned value       :   无
***********************************************************************************************************/
void vTaskSched(void);
#endif
